study/devops/ansible/ansible.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Ansible</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Ansible</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org6f9fe85">Usage</a></li>
<li><a href="#orgaf2a3ba">From Docs</a></li>
<li><a href="#orgfe16713">Automating</a></li>
<li><a href="#orge44f8c5">Ansible tutorial - GitHub</a></li>
<li><a href="#orgaa2eaf0">WSL stuff to automate</a></li>
<li><a href="#org44e9988">Ansible on Windows</a>
<ul>
<li><a href="#orgd58c43f">Tutorial</a></li>
<li><a href="#org1a270f8">Through WSL</a></li>
</ul>
</li>
<li><a href="#orga3dc242">Ansible on Termux</a></li>
<li><a href="#orgf91fd84">Active Directory on Ansible</a></li>
<li><a href="#orgbed5d20">Tutorials</a>
<ul>
<li><a href="#org65dbc8c">Ansible Full Course - SimpliLearn</a></li>
<li><a href="#org11d3159">How to manage machines</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
&gt; <a href="https://github.com/ansible-community/awesome-ansible">Awesome Ansible - github page</a>
&gt; <a href="https://docs.ansible.com/ansible/latest/getting_started/index.html">Getting started with Ansible - docs.ansible.com</a>
</p>

<div id="outline-container-org6f9fe85" class="outline-2">
<h2 id="org6f9fe85">Usage</h2>
</div>
<div id="outline-container-orgaf2a3ba" class="outline-2">
<h2 id="orgaf2a3ba">From Docs</h2>
<div class="outline-text-2" id="text-orgaf2a3ba">
<p>
Ansible automates the management of remote systems and controls their desired state. A basic Ansible environment has three main components:
</p>

<ul class="org-ul">
<li><span class="underline">Control node</span>: A system on which Ansible is installed. You run Ansible commands such as <code>ansible</code> or <code>ansible-inventory</code> on a control node.</li>
<li><span class="underline">Managed node</span>: A remote system, or host, that Ansible controls.</li>
<li><span class="underline">Inventory</span>: A list of managed nodes that are logically organized. You create an inventory on the control node to describe host deployments to Ansible.</li>
</ul>
</div>
</div>

<div id="outline-container-orgfe16713" class="outline-2">
<h2 id="orgfe16713">Automating</h2>
<div class="outline-text-2" id="text-orgfe16713">
<p>
After installing ansible, create an inventory adding the IP addresses of one or more remote systems to <code>/etc/ansible/hosts</code>.
</p>

<p>
example, <code>/etc/ansible/hosts</code>
</p>
<div class="org-src-container">
<pre class="src src-text">[myvirtualmachines]
192.0.2.50
192.0.2.51
192.0.2.52
</pre>
</div>

<ol class="org-ol">
<li>Verify the hosts in the inventory</li>
</ol>
<p>
<code>$ ansible all --list-hosts</code>
</p>

<div class="org-src-container">
<pre class="src src-text">2
</pre>
</div>

<ol class="org-ol">
<li></li>
</ol>
</div>
</div>

<div id="outline-container-orge44f8c5" class="outline-2">
<h2 id="orge44f8c5">Ansible tutorial - GitHub</h2>
<div class="outline-text-2" id="text-orge44f8c5">
<p>
Ansible is a <b>configuration management software</b> that let's you control and configure nodes from another machine. It uses SSH infrastructure instead of PKI like <i>Chef</i>, <i>Puppet</i> to be set up.
</p>

<p>
It emphasizes push mode, configuration is pushed from a master machine, which is only <span class="underline">a machine where you can SSH to nodes from</span>)
</p>

<p>
All that's necessary is for nodes to be accesible, the master doesn't need to be 'publicly' accessible.
</p>
</div>
</div>

<div id="outline-container-orgaa2eaf0" class="outline-2">
<h2 id="orgaa2eaf0">WSL stuff to automate</h2>
<div class="outline-text-2" id="text-orgaa2eaf0">
<p>
Downlading
</p>

<ul class="org-ul">
<li>Installing
<ul class="org-ul">
<li>sudo apt install -y emacs zathura
<ul class="org-ul">
<li>rm -r <code>~/.emacs.d</code></li>
<li>git clone <a href="https://github.com/asynthe/emacs.git">https://github.com/asynthe/emacs.git</a></li>
<li>mv emacs <code>/.config</code></li>
</ul></li>
</ul></li>

<li>Fonts
<ul class="org-ul">
<li>iosevka</li>
<li>iosevka term</li>
<li>jetbrains mono nerd font</li>
</ul></li>
<li>Unzip and copy to <code>~/.local/share/fonts</code></li>
<li>Run the comand <code>fc-cache -fv</code> to manually rebuild the font cache</li>
</ul>
</div>
</div>

<div id="outline-container-org44e9988" class="outline-2">
<h2 id="org44e9988">Ansible on Windows</h2>
<div class="outline-text-2" id="text-org44e9988">
<p>
&gt; <a href="https://docs.ansible.com/ansible/latest/os_guide/windows_winrm.html">Windows Remote Management - docs.ansible.com</a>
</p>

<ul class="org-ul">
<li>Ansible on Windows?
<ul class="org-ul">
<li>Seems not possible, unless there's a SSH connection to a Linux machine.</li>
<li>This host can manage Windows and auto install packages through the <b>chocolatey</b> package manager.</li>
</ul></li>
</ul>

<p>
&#x2026;
</p>

<p>
&gt; <a href="https://stackoverflow.com/questions/58345011/setup-windows-10-workstation-using-ansible-installed-on-wsl">Setup windows 10 workstation using Ansible installed on WSL - StackOverflow</a>
</p>

<p>
&gt; <a href="https://medium.com/@selvamraju007/automating-microsoft-windows-servers-using-ansible-6792cb89d588">Automating Microsoft Windows servers using Ansible - Medium</a>
</p>

<p>
&gt; <a href="https://www.linuxtechi.com/manage-windows-host-using-ansible/">How to Manage Remote Windows Host using Ansible - LinuxTechi</a>
</p>

<p>
Test
&gt; <a href="https://github.com/vecin2/ws_playbook">vecin2/ws<sub>playbook</sub> - github</a>
</p>
</div>

<div id="outline-container-orgd58c43f" class="outline-3">
<h3 id="orgd58c43f">Tutorial</h3>
<div class="outline-text-3" id="text-orgd58c43f">
<p>
~$ sudo dnf install python3-virtualenv
~$ virtualenv env
~$ source env/bin/activate
</p>

<p>
Install Ansible
<code>$ pip install ansible</code>
</p>

<p>
Check version
<code>$ ansible --version</code>
</p>

<p>
Test
<code>$ ansible localhost -m ping</code>
</p>

<p>
Define the windows host in <code>/etc/ansible/hosts</code>
</p>
<div class="org-src-container">
<pre class="src src-text">[winhost]
&lt;windows-ip-here&gt;

[winhost:vars]
ansible_user=&lt;your-win-user&gt;
ansible_password=&lt;your-win-user-pass&gt;
ansible_connection=winrm
ansible_winrm_server_cert_validation=ignore
</pre>
</div>
<p>
<span class="underline">note</span>: The username and password point to the user on the Windows host system.
</p>

<p>
To communicate with Windows hosts, you will need to install Winrm. (in Linux system)
<code>$ pip install pywinrm</code>
</p>
</div>
</div>

<div id="outline-container-org1a270f8" class="outline-3">
<h3 id="org1a270f8">Through WSL</h3>
<div class="outline-text-3" id="text-org1a270f8">
<p>
In this case WSL needs a different connection.
</p>

<p>
You can run a playbook for WSL or for Windows host but <span class="underline">not against both</span>, as they need a different connection.
</p>

<p>
To do both you can either set hash-behaviour, or set two different host names for localhost under WSL <code>/etc/hosts</code>.
</p>

<p>
Setting up two different hostnames for localhost (in WSL)
</p>
<div class="org-src-container">
<pre class="src src-text">127.0.0.1    wsl.local
127.0.0.1    windows.local
</pre>
</div>

<p>
Now, in <code>/etc/ansible/hosts</code>
</p>
<div class="org-src-container">
<pre class="src src-text">[wsl]
wsl.local 

[wsl:vars]
ansible_connection=local

[windows]
windows.local 
[windows:vars]
ansible_port=5985
ansible_connection=winrm
ansible_winrm_transport=basic
ansible_user=&lt;&lt;ansible_user&gt;&gt;
ansible_password=&lt;&lt;ansible_password&gt;&gt;
</pre>
</div>

<p>
<i>ws<sub>playbook</sub> - github</i>
Help setting wsl environment within a Windows 10 machine.
<a href="https://github.com/vecin2/ws_playbook">https://github.com/vecin2/ws_playbook</a>
</p>
</div>
</div>
</div>

<div id="outline-container-orga3dc242" class="outline-2">
<h2 id="orga3dc242">Ansible on Termux</h2>
<div class="outline-text-2" id="text-orga3dc242">
<p>
Get Ansible working on an Android phone using a Terminal Emulator like Termux
&gt; <a href="https://gist.github.com/kuttor/5540b0b7ee18ea62283068b03813693e">ansible-termix.sh - github gist</a>
</p>
</div>
</div>

<div id="outline-container-orgf91fd84" class="outline-2">
<h2 id="orgf91fd84">Active Directory on Ansible</h2>
</div>

<div id="outline-container-orgbed5d20" class="outline-2">
<h2 id="orgbed5d20">Tutorials</h2>
<div class="outline-text-2" id="text-orgbed5d20">
</div>
<div id="outline-container-org65dbc8c" class="outline-3">
<h3 id="org65dbc8c">Ansible Full Course - SimpliLearn</h3>
<div class="outline-text-3" id="text-org65dbc8c">
<p>
Push a configuration to various nodes from a host.
Remember that:
</p>

<div class="org-src-container">
<pre class="src src-text">host
  &#9500;&#9472;&#9472; node1
  &#9500;&#9472;&#9472; node2
  &#9492;&#9472;&#9472; nod1e3
</pre>
</div>

<p>
Installing on Ubuntu.
</p>
</div>
</div>

<div id="outline-container-org11d3159" class="outline-3">
<h3 id="org11d3159">How to manage machines</h3>
<div class="outline-text-3" id="text-org11d3159">
<p>
-&gt; /etc/ansible
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.3 (<a href="https://orgmode.org">Org</a> mode 9.6.15)</p>
</div>
</body>
</html>
